ГТС/УТГТС/AccumulationRegisters/РетроБонусыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РетроБонусыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонус</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КАктированию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПодписанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументУсловий</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УсловияРетроБонусовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/РетроБонусыКлиентовУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РетроБонусыКлиентовУсловия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРетроБонусовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоставУчастников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставыУчастниковРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участники</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставыСписковРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоставТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставыТоваровРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Товары</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоставыСписковРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьУсловий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализацияРасчетаУчастников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДетализацияРасчетаУчастниковРетроБонусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретНачисленияСверхПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксацияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидШкалыРасчета</Name>
					<Comment>Для базы по количеству: 0 - прогрессивная шкала, 1 - по диапазонам.  Для базы по сумме: 0 - одно значение, 1 - прогрессивная шкала, 2 - по диапазонам.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УсловияРетроБонусовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументУсловий</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УсловияРетроБонусовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РетроБонусыКлиентов/Forms/ФормаПодбораПоОстаткам/Ext/Form/Module.bsl
//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Организация)
	 ИЛИ НЕ ЗначениеЗаполнено(Параметры.Контрагент)  Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Организация = Параметры.Организация;
	Контрагент = Параметры.Контрагент;
	ДатаАктуальности = Параметры.ДатаАктуальности;
	Если ЗначениеЗаполнено(Параметры.Валюта) Тогда
		
		ВалютаДокумента = Параметры.Валюта;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.АдресТаблицыПодобранныхСтрок) Тогда
		
		АдресВХранилище = Параметры.АдресТаблицыПодобранныхСтрок;
		ПодобранныеСтроки = ПолучитьИзВременногоХранилища(АдресВХранилище); // ТаблицаЗначений
		УдалитьИзВременногоХранилища(АдресВХранилище);
		ОстаткиРетроБонусов.Загрузить(ПодобранныеСтроки);
		
	КонецЕсли;
	
	ДанныеОстатковВТаблицуЗначений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого НомерСтроки Из Элементы.ОстаткиРетроБонусов.ВыделенныеСтроки Цикл // Число 
		
		СтрокаОстатков = ОстаткиРетроБонусов.НайтиПоИдентификатору(НомерСтроки);
		
		Если НЕ СтрокаОстатков.ДокументВыбран Тогда
			
			СтрокаОстатков.ДокументВыбран = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для Каждого НомерСтроки Из Элементы.ОстаткиРетроБонусов.ВыделенныеСтроки Цикл // Число
		
		СтрокаОстатков = ОстаткиРетроБонусов.НайтиПоИдентификатору(НомерСтроки);
		
		Если СтрокаОстатков.ДокументВыбран Тогда
			
			СтрокаОстатков.ДокументВыбран = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковРБВыполнитьВыборЗначения(Команда)
	
	ОчиститьСообщения();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументВыбран", Истина);
	НайденныеСтроки = ОстаткиРетроБонусов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Отказ = Ложь;
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			
			Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
				ВалютаДокумента = СтрокаТаблицы.Валюта;
			КонецЕсли;
			
			Если СтрокаТаблицы.Валюта <> ВалютаДокумента Тогда
				
				ВалютаДокумента = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
				ТекстСообщения = НСтр("ru = 'Выбраны строки с разной валютой, перенос в документ невозможен'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		Если НЕ Отказ Тогда
			
			АдресВХранилище = АдресРезультатаВХранилище();
			Закрыть(АдресВХранилище);
			
		КонецЕсли;
		
	Иначе
		
		ВыполнитьВыборЗначенияСВопросом();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОстаткиРетроБонусов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиРетроБонусов.ДокументВыбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Gray);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьВыборЗначенияСВопросом()
	
	ТекстВопроса = НСтр("ru = 'Не выбрано ни одной строки. Продолжить?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет); // КодВозвратаДиалога
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		АдресВХранилище = АдресРезультатаВХранилище();
		Закрыть(АдресВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеОстатковВТаблицуЗначений()
	
	Граница =  Новый Граница(КонецДня(ДатаАктуальности), ВидГраницы.Включая);
	
	КоличествоСтрок = ОстаткиРетроБонусов.Количество();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОстаткиВыбранные.Валюта КАК Валюта,
	|	ОстаткиВыбранные.НомерСтроки КАК НомерСтроки,
	|	ОстаткиВыбранные.ДокументВыбран КАК ДокументВыбран,
	|	ОстаткиВыбранные.ДокументУсловий КАК ДокументУсловий,
	|	ОстаткиВыбранные.НачалоПериода КАК НачалоПериода,
	|	ОстаткиВыбранные.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ОстаткиВыбранные.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_ОстаткиВыбранные
	|ИЗ
	|	&ОстаткиРетроБонусов КАК ОстаткиВыбранные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РетроБонусыКлиентов.Партнер КАК Партнер,
	|	РетроБонусыКлиентов.НачалоПериода КАК НачалоПериода,
	|	РетроБонусыКлиентов.ОкончаниеПериода КАК ОкончаниеПериода,
	|	РетроБонусыКлиентов.ДокументУсловий КАК ДокументУсловий,
	|	РетроБонусыКлиентов.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА РетроБонусыКлиентов.СуммаБонусНачальныйОстаток - РетроБонусыКлиентов.КАктированиюНачальныйОстаток - РетроБонусыКлиентов.КПодписаниюНачальныйОстаток - РетроБонусыКлиентов.КСписаниюНачальныйОстаток > РетроБонусыКлиентов.СуммаБонусКонечныйОстаток - РетроБонусыКлиентов.КАктированиюКонечныйОстаток - РетроБонусыКлиентов.КПодписаниюКонечныйОстаток - РетроБонусыКлиентов.КСписаниюКонечныйОстаток
	|			ТОГДА РетроБонусыКлиентов.СуммаБонусКонечныйОстаток - РетроБонусыКлиентов.КАктированиюКонечныйОстаток - РетроБонусыКлиентов.КПодписаниюКонечныйОстаток - РетроБонусыКлиентов.КСписаниюКонечныйОстаток
	|		ИНАЧЕ РетроБонусыКлиентов.СуммаБонусНачальныйОстаток - РетроБонусыКлиентов.КАктированиюНачальныйОстаток - РетроБонусыКлиентов.КПодписаниюНачальныйОстаток - РетроБонусыКлиентов.КСписаниюНачальныйОстаток
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОстаткиБонусов
	|ИЗ
	|	РегистрНакопления.РетроБонусыКлиентов.ОстаткиИОбороты(
	|			&Период,
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И &УсловиеВалюта) КАК РетроБонусыКлиентов
	|ГДЕ
	|	РетроБонусыКлиентов.СуммаБонусНачальныйОстаток - РетроБонусыКлиентов.КАктированиюНачальныйОстаток - РетроБонусыКлиентов.КПодписаниюНачальныйОстаток - РетроБонусыКлиентов.КСписаниюНачальныйОстаток > 0
	|	И РетроБонусыКлиентов.СуммаБонусКонечныйОстаток - РетроБонусыКлиентов.КАктированиюКонечныйОстаток - РетроБонусыКлиентов.КПодписаниюКонечныйОстаток - РетроБонусыКлиентов.КСписаниюКонечныйОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОстаткиВыбранные.ДокументВыбран, ЛОЖЬ) КАК ДокументВыбран,
	|	ЕСТЬNULL(ВТ_ОстаткиВыбранные.НомерСтроки, &КоличествоСтрок) КАК НомерСтроки,
	|	ОстаткиБонусов.Партнер КАК Партнер,
	|	ОстаткиБонусов.ДокументУсловий КАК ДокументУсловий,
	|	ОстаткиБонусов.НачалоПериода КАК НачалоПериода,
	|	ОстаткиБонусов.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ОстаткиБонусов.Валюта КАК Валюта,
	|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Вид, ЗНАЧЕНИЕ(Справочник.ВидыРетроБонусовКлиентов.ПустаяСсылка)) КАК ВидРетроБонуса,
	|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Описание, """") КАК Описание,
	|	ОстаткиБонусов.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_Подготовка
	|ИЗ
	|	ВТ_ОстаткиБонусов КАК ОстаткиБонусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВыбранные КАК ВТ_ОстаткиВыбранные
	|		ПО ОстаткиБонусов.Партнер = ВТ_ОстаткиВыбранные.Партнер
	|			И ОстаткиБонусов.Валюта = ВТ_ОстаткиВыбранные.Валюта
	|			И ОстаткиБонусов.ДокументУсловий = ВТ_ОстаткиВыбранные.ДокументУсловий
	|			И ОстаткиБонусов.НачалоПериода = ВТ_ОстаткиВыбранные.НачалоПериода
	|			И ОстаткиБонусов.ОкончаниеПериода = ВТ_ОстаткиВыбранные.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыКлиентовУсловия КАК РетроБонусыКлиентовУсловия
	|		ПО ОстаткиБонусов.ДокументУсловий = РетроБонусыКлиентовУсловия.ДокументУсловий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Подготовка.ДокументВыбран) КАК ДокументВыбран,
	|	МИНИМУМ(ВТ_Подготовка.НомерСтроки) КАК НомерСтроки,
	|	ВТ_Подготовка.Партнер КАК Партнер,
	|	ВТ_Подготовка.ДокументУсловий КАК ДокументУсловий,
	|	ВТ_Подготовка.НачалоПериода КАК НачалоПериода,
	|	ВТ_Подготовка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ВТ_Подготовка.Валюта КАК Валюта,
	|	ВТ_Подготовка.ВидРетроБонуса КАК ВидРетроБонуса,
	|	ВТ_Подготовка.Описание КАК Описание,
	|	ВТ_Подготовка.Сумма КАК Сумма
	|ИЗ
	|	ВТ_Подготовка КАК ВТ_Подготовка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Подготовка.Партнер,
	|	ВТ_Подготовка.ДокументУсловий,
	|	ВТ_Подготовка.НачалоПериода,
	|	ВТ_Подготовка.ОкончаниеПериода,
	|	ВТ_Подготовка.Валюта,
	|	ВТ_Подготовка.ВидРетроБонуса,
	|	ВТ_Подготовка.Описание,
	|	ВТ_Подготовка.Сумма
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументВыбран УБЫВ,
	|	НомерСтроки,
	|	ДокументУсловий,
	|	Партнер";
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ТекстУсловияВалюта = "Валюта = &Валюта";
	Иначе
		ТекстУсловияВалюта = "ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВалюта", ТекстУсловияВалюта);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОстаткиРетроБонусов", ОстаткиРетроБонусов.Выгрузить());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Граница);
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента);
	Запрос.УстановитьПараметр("КоличествоСтрок", КоличествоСтрок);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ДанныеОбОстатках = РезультатЗапроса.Выгрузить();
		ОстаткиРетроБонусов.Загрузить(ДанныеОбОстатках);
		
	Иначе
		ОстаткиРетроБонусов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресРезультатаВХранилище()
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументВыбран", Истина);
	
	Возврат ПоместитьВоВременноеХранилище(ОстаткиРетроБонусов.Выгрузить(Отбор));
	
КонецФункции

#КонецОбласти
